Revit 2026 API

# ProjectLocationSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ProjectLocationSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
ProjectLocationSetIterator()
```
```fsharp
new : unit -> ProjectLocationSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ProjectLocationSetIterator Class

Autodesk.Revit.DB Namespace